Repository: earloc/TypealizR
Catalog: src/TypealizR.Core/Diagnostics/Strings.*.resx
Languages: de

# TR0001_Description
source: The code generator could not determine the projects root-directory
de: Der Quellcodegenerator konnte das Basisverzeichnis des Projektes nicht finden

# TR0001_MessageFormat
source: The code generator could not determine the projects root-directory. See {0}
de: Der Quellcodegenerator konnte das Basisverzeichnis des Projektes nicht finden. Siehe {0}

# TR0002_Description
source: Encountered an ambigious resource-key
de: Nicht eineindeutiger Schlüssel gefunden

# TR0002_MessageFormat
source: Resource-key '{0}' would end up as a duplicate method-name. Using '{1}' as derived name for this key. See {2}
de: Die Ressource enthält den Schlüssel '{0}', welcher in einem doppelten Methodenname resultieren würde. Stattdessen wird '{1}' verwendet. Siehe {2}

# TR0003_Description
source: Encountered a generic parameter
de: Generischer Paremtername gefunden

# TR0003_MessageFormat
source: Resource-key '{0}' uses the generic format-parameter '{1}'. Consider to use a more meaningful name, instead. See {2}
de: Die Ressource '{0}' verwendet den generischen Parameter '{1}'. Hier sollte die Verwendung eines sinnvolleren Namens in Betracht gezogen werden. Siehe {2}

# TR0004_Description
source: Encountered an unrecognized parameter-type
de: Unbekannter Parametertyp gefunden

# TR0004_MessageFormat
source: Ressource-key '{0}' uses unrecognized parameter-annotation '{1}'. Falling back to 'object'. See {2}
de: Die Ressource '{0}' verwendet die unbekannte Parametertyp-Annotation '{1}'. Stattdessen wird 'object' verwendet. Siehe {2}

# TR0005_Description
source: MemberName would be un-compilable
de: Name wäre nicht kompilierbar

# TR0005_MessageFormat
source: Ressource-key '{0}' reduced to '{1}' would be non-compilable. Falling back to '{2}'. See {3}
de: Die Ressource '{0}' wurde zu '{1}' reduziert, wäre jedoch nicht kompilierbar. Stattdessen wird '{2}' verwendet. Siehe {3}
